{
    "name": "functional_5",
    "trainable": true,
    "layers": [
        {
            "module": "keras.layers",
            "class_name": "InputLayer",
            "config": {
                "batch_shape": [
                    null,
                    1
                ],
                "dtype": "float32",
                "sparse": false,
                "name": "input_embedded"
            },
            "registered_name": null,
            "name": "input_embedded",
            "inbound_nodes": []
        },
        {
            "module": "keras.layers",
            "class_name": "Embedding",
            "config": {
                "name": "embedding_2",
                "trainable": true,
                "dtype": "float32",
                "input_dim": 1051,
                "output_dim": 50,
                "embeddings_initializer": {
                    "module": "keras.initializers",
                    "class_name": "RandomUniform",
                    "config": {
                        "minval": -0.05,
                        "maxval": 0.05,
                        "seed": null
                    },
                    "registered_name": null
                },
                "embeddings_regularizer": null,
                "activity_regularizer": null,
                "embeddings_constraint": null,
                "mask_zero": false
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    1
                ]
            },
            "name": "embedding_2",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    1
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "input_embedded",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Flatten",
            "config": {
                "name": "flatten_2",
                "trainable": true,
                "dtype": "float32",
                "data_format": "channels_last"
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    1,
                    50
                ]
            },
            "name": "flatten_2",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    1,
                                    50
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "embedding_2",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "InputLayer",
            "config": {
                "batch_shape": [
                    null,
                    2
                ],
                "dtype": "float32",
                "sparse": false,
                "name": "input_numerical"
            },
            "registered_name": null,
            "name": "input_numerical",
            "inbound_nodes": []
        },
        {
            "module": "keras.layers",
            "class_name": "Concatenate",
            "config": {
                "name": "concatenate_2",
                "trainable": true,
                "dtype": "float32",
                "axis": -1
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    [
                        null,
                        50
                    ],
                    [
                        null,
                        2
                    ]
                ]
            },
            "name": "concatenate_2",
            "inbound_nodes": [
                {
                    "args": [
                        [
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        50
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "flatten_2",
                                        0,
                                        0
                                    ]
                                }
                            },
                            {
                                "class_name": "__keras_tensor__",
                                "config": {
                                    "shape": [
                                        null,
                                        2
                                    ],
                                    "dtype": "float32",
                                    "keras_history": [
                                        "input_numerical",
                                        0,
                                        0
                                    ]
                                }
                            }
                        ]
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense_6",
                "trainable": true,
                "dtype": "float32",
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    52
                ]
            },
            "name": "dense_6",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    52
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "concatenate_2",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense_7",
                "trainable": true,
                "dtype": "float32",
                "units": 160,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    64
                ]
            },
            "name": "dense_7",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    64
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "dense_6",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        },
        {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
                "name": "dense_8",
                "trainable": true,
                "dtype": "float32",
                "units": 3,
                "activation": "softmax",
                "use_bias": true,
                "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": {
                        "seed": null
                    },
                    "registered_name": null
                },
                "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            },
            "registered_name": null,
            "build_config": {
                "input_shape": [
                    null,
                    160
                ]
            },
            "name": "dense_8",
            "inbound_nodes": [
                {
                    "args": [
                        {
                            "class_name": "__keras_tensor__",
                            "config": {
                                "shape": [
                                    null,
                                    160
                                ],
                                "dtype": "float32",
                                "keras_history": [
                                    "dense_7",
                                    0,
                                    0
                                ]
                            }
                        }
                    ],
                    "kwargs": {}
                }
            ]
        }
    ],
    "input_layers": [
        [
            "input_embedded",
            0,
            0
        ],
        [
            "input_numerical",
            0,
            0
        ]
    ],
    "output_layers": [
        [
            "dense_8",
            0,
            0
        ]
    ]
}